In [42]:
import pandas as pd

In [43]:
path = "G:\\My Drive\\Tomography\\Shared Hasil\\Sumatera\\data_dukung"

In [44]:
topo = pd.read_csv(path+"\\sumatera_topography.txt", delim_whitespace=True,names=["lon","lat","h"])
FAA = pd.read_csv(path+"\\sumatera_gravity.txt", delim_whitespace=True,names=["lon","lat","FAA"])

In [45]:
SBA = pd.DataFrame([],columns=["lon","lat","SBA"])
SBA

Empty DataFrame
Columns: [lon, lat, SBA]
Index: []

In [46]:
SBA.lat = topo.lat
SBA.lon = topo.lon

In [47]:
SBA

             lon     lat  SBA
0        92.0083  7.0076  NaN
1        92.0250  7.0076  NaN
2        92.0417  7.0076  NaN
3        92.0583  7.0076  NaN
4        92.0750  7.0076  NaN
...          ...     ...  ...
709799  105.9417 -7.0074  NaN
709800  105.9583 -7.0074  NaN
709801  105.9750 -7.0074  NaN
709802  105.9917 -7.0074  NaN
709803  106.0083 -7.0074  NaN

[709804 rows x 3 columns]

In [48]:
SBA.SBA = FAA.FAA - (0.0429*2.67*topo.h)
SBA

             lon     lat         SBA
0        92.0083  7.0076  443.117430
1        92.0250  7.0076  444.240978
2        92.0417  7.0076  444.864526
3        92.0583  7.0076  445.229902
4        92.0750  7.0076  445.937106
...          ...     ...         ...
709799  105.9417 -7.0074  172.750204
709800  105.9583 -7.0074  173.084828
709801  105.9750 -7.0074  172.999506
709802  105.9917 -7.0074  171.968754
709803  106.0083 -7.0074  171.154346

[709804 rows x 3 columns]

In [49]:
SBA.to_csv(path+"\\sumatera_gravity_correction.txt",sep="\t",index=False)